---
type: TessellatedBuildIssue
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# TessellatedBuildIssue

`Autodesk.Revit.DB.TessellatedBuildIssue` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetIssueDescription | 2015 | `public string GetIssueDescription ()` |
| Method | IsValidIssue | 2015 | `public bool IsValidIssue ()` |
| Method | MakesDataUnusable | 2015 | `public bool MakesDataUnusable ()` |
| Method | ReportIssueToDataSource | 2015 | `public bool ReportIssueToDataSource ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NumberEncountered | 2015 | `public int NumberEncountered { get ; }` |